package com.hechuang.hepay.bean;

/**
 * 临时数据
 */

public class Temporarydata {

    public static String recycler_loadinghint = "拼命加载中";
    public static String recycler_nomorehint = "已经全部为你呈现了";
    public static String recycler_nonetworkhint = "网络不给力啊，点击再试一次吧";

    public static String login_agreement = "用户协议\n" +
            "  禾田付注册用户协议是（以下简称本协议）由河南够幸运电子商务有限公司（以下简称禾田付）向用户提供的禾田付软件系统（以下简称本系统）及(或)附随的款项代收代付的中介服务。本协议由您和本公司签订。\n" +
            "   一、声明与承诺\n" +
            "  （一）在接受本协议或您以本公司允许的其他方式注册用户，参与、分享禾田付平台的服务，实际使用禾田付服务之前，请您仔细阅读本协议的全部内容（特别是以粗体标注的内容）。如果您不同意本协议的任意内容，或者无法准确理解本公司对条款的解释，请不要进行后续操作，包括但不限于不要接受本协议，不使用本服务。\n" +
            "  （二）您同意，本公司有权随时对本协议内容进行单方面的变更，并以在本软件公告的方式予以公布，无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务；若您不同意修改后的协议内容，您应停止使用本服务。 \n" +
            "  （三）您保证，在您同意接受本协议并注册成为禾田付用户时，您已经年满16周岁， 或者您是在中国大陆地区合法开展经营活动或其他业务的法人或其他组织；本协议内容不受您所属国家或地区法律的排斥。不具备前述条件的，您应立即终止注册或停止使用本服务。您在使用禾田付服务时，应自行判断对方是否是完全民事行为能力人并自行决定是否与对方进行交易或转账给对方等，且您应自行承担与此相关的所有风险。\n" +
            "  二、定义及服务说明\n" +
            "  （一）禾田付账户（或“该账户”）：指您按照本公司允许的方式取得的供您使用禾田付服务的账户。\n" +
            "  （二）禾田付手机客户端提供的是禾田付用户转账支付、消费支付，并参与分享、创业的综合支付软件。在合法的基础上，公司完全有权自行根据市场和使用的需要，执行合并、分立等方式方法运行上述软件系统。\n" +
            "  根据系统的设定，系统用户会根据您选择成为用户级别的不同，为您提供相应的用户服务，不同级别的用户的使用、参与、分享的权利义务有所不同。这些将以您在系统上以您的自愿选择和设置的选项为依据，予以相应的权利义务。这些权利义务，将以本系统的以下相关文书记载、说明和规定为依据。您在本系统的权利义务将以以下普遍性规则、规定、章程、协议等相关规定或为了系统共同利益、个别特殊、临时制定的文书等为准。如果您注册、使用参与本系统的任何运营、操作，在您成为用户的之前，您必须确认您已经充分认知、认识、理解和确认完全接受、同意本系统的规则、规定、规章，经自愿注册成为系统用户。\n" +
            "  （三）现金余额\n" +
            "  禾田付系统中每个用户都拥有对应的现金余额账户，现金余额账户中的金额即为用户的现金余额，可以通过提现转到用户的指定的银行卡上，同时也可以应用于转帐、消费服务。现金余额的获得是通过充值、转账、收款、红包转现等方式获得。\n" +
            "  （四）消费分红积分规则\n" +
            "  禾田付系统中每个用户都拥有相应的红包分红账户，消费分红积分的获得是通过消费、收款、分享、管理中免费获得。用户获得分红积分达到一万积分以上，按积分的总额在每天凌晨00:00后，平台从全国商家促销广告费中按用户积分总额万分之五左右分配消费分红。用户登录后台拆开红包后获得电子币，用户参与分红后从总积分减去相应额度，拆红包有效期最高7天，过期不拆红包失效用户总积分同样会减相应积分。\n" +
            "  禾田付智慧商圈联盟商家赠送的积分全国通用，也可在商城网站免费兑换、兑购礼品以及参与积分活动，相关运费、兑换规则由按厂家、商家设定为准；\n" +
            "  1、支付获得：用户去合作商家消费支付的款项按商家广告费的比例免费获得相应的消费分红积分。\n" +
            "  2、分享用户获得：用户在分享用户后可以持续获得新用户在联盟商家消费免费获得积分的相应积分奖励。\n" +
            "  3、分享商家获得：用户分享推荐商家参与本活动，按商家的总促销积分比例与自己的用户级别获得相应的分红积分奖励。\n" +
            "  4、管理获得：用户可申请成为城市合伙人，合伙人按管理区域的商家促销积分总额一定比例获得分红积分奖励。\n" +
            "  三、禾田付账户\n" +
            "  （一） 注册相关\n" +
            "  在使用本服务前，您必须先行注册，取得本公司提供给您的禾田付账户（以下亦简称该账户），您同意：\n" +
            "  1、按照禾田付要求准确提供并在取得该账户后及时更新您正确、最新及完整的身份信息及相关资料。若本公司有合理理由怀疑您提供的身份信息及相关资料错误、不实、过时或不完整的，本公司有权暂停或终止向您提供部分或全部禾田付服务。本公司对此不承担任何责任，您将承担因此产生的任何直接或间接支出。若因国家法律法规、部门规章或监管机构的要求，本公司需要您补充提供任何相关资料时，如您不能及时配合提供，本公司有权暂停或终止向您提供部分或全部禾田付服务。\n" +
            "  2、因您未及时更新资料（包括但不限于身份证、户口本、护照等证件或其他身份证明文件、联系方式、与禾田付账户绑定的邮箱、手机号码等），导致本服务无法提供或提供时发生任何错误，您不得将此作为取消交易、拒绝付款的理由，您将承担因此产生的一切后果，本公司不承担任何责任。 \n" +
            "  3、您应对您的禾田付账户负责，只有您本人可以使用您的禾田付账户，该账户不可转让、不可赠与、不可继承。在您决定不再使用该账户时，您应将该账户下所对应的可用款项全部提现或者向本公司发出其它支付指令，并向本公司申请注销该账户。\n" +
            "您同意，若您丧失全部或部分民事权利能力或民事行为能力，本公司有权根据有效法律文书（包括但不限于生效的法院判决、生效的遗嘱等）处置与您的禾田付账户相关的款项。 \n" +
            "  （二）用户权益\n" +
            "  1、普通用户：免费注册。用户使用禾田付软件支付消费的款项都将获得商家赠送相应的分红积分，积分分红红包每天以最高0.03%的基准速度参与分红，\n" +
            "  2、VIP用户为收费商家 、合伙人、各级创客；积分分红红包每天以最高0.05%的基准速度参与分红直至将消费分红积分权用完为止。\n" +
            "  备注：此转化速度会根据系统参数改变而进行改变。\n" +
            "  3、用户推荐权益：\n" +
            "  用户通过分享推荐用户，享受其去禾田付联盟商家获得消费分红积分相应的积分奖励。本推荐分享是单层分享，即A推荐B，B推荐C，C与A无任何关联。\n" +
            "  （三）关于手续费与税金说明\n" +
            "  1、禾田付用户可将现金余额账户中的现金提取到甲方指定的银行卡里。乙方在禾田付提现成功后的下一个工作日，提现款项免交易手续费结算至本协议约定的用户银行卡账户（以下简称“甲方账户”）中。甲方现金余额提现规则是100元一个单位，未达到人民币100元则待金额达到100元时才可提现，每次提现为100的倍数，不足100元的余额将留存在甲方现金余额账户里。\n" +
            "  2、禾田付税金与`红包分红转现手续费\n" +
            "  推荐佣金与分红收入，需要扣税15%，以及手续费2%，扣除的节点在，佣金分配时直接扣除。所有红包分红零点按万分之五转成现金余额的过程中，均要扣除17%的税金及手续费。\n" +
            "  （四） 账户安全\n" +
            "  您将对使用该账户及密码进行的一切操作及言论负完全的责任，您同意：\n" +
            "  1、本公司通过您的账户名和密码识别您的指示，您应当妥善保管您的账户名和密码及身份信息，对于因密码泄露、身份信息泄露所致的损失，由您自行承担。您保证不向其他任何人泄露该账户名及密码以及身份信息，亦不使用其他任何人的禾田付账户及密码。本公司亦可能通过本服务应用您使用的其他产品或设备识别您的指示，您应当妥善保管处于您或应当处于您掌控下的这些产品或设备，对于这些产品或设备遗失所致的任何损失，由您自行承担。\n" +
            "  2、如您发现有他人冒用或盗用您的账户及密码或任何其他未经合法授权之情形时，应立即以有效方式通知本公司，要求本公司暂停相关服务。同时，您理解本公司对您的请求采取行动需要合理期限，在此之前，本公司对已执行的指令及(或)所导致的您的损失不承担任何责任。 \n" +
            "  3、交易异常处理：您使用本服务时同意并认可，可能由于银行本身系统问题、银行相关作业网络连线问题或其他不可抗拒因素，造成本服务无法提供。您确保您所输入的您的资料无误，如果因资料错误造成本公司于上述异常状况发生时，无法及时通知您相关交易后续处理方式的，本公司不承担任何损害赔偿责任。\n" +
            "  4、您同意，基于运行和交易安全的需要，本公司可以暂时停止提供或者限制本服务部分功能,或提供新的功能，在任何功能减少、增加或者变化时，只要您仍然使用本服务，表示您仍然同意本协议或者变更后的协议。\n" +
            "  5、本公司有权了解您使用本公司产品或服务的真实交易背景及目的，您应如实提供本公司所需的真实、全面、准确的信息；如果本公司有合理理由怀疑您提供虚假交易信息的，本公司有权暂时或永久限制您所使用的产品或服务的部分或全部功能。\n" +
            "  6、您同意，为了您的禾田付账户及其内资金的安全，根据本协议的约定、法律法规及法律文书的规定、政府依行政职权的要求及本公司依据自行判断认为的可能对您的禾田付账户产生风险的情况，本公司有权对您的禾田付账户进行冻结，即进行暂时关闭该账户部分或全部使用权限的操作。冻结的逆过程为解冻，即本公司对您的被冻结的禾田付账户结束冻结。当冻结发生时，如您申请解冻，本公司有权依照自行判断根据本项规定前述的冻结原因来决定是否允许解冻，您应充分理解您的解冻申请并不必然被允许，且申请解冻时您应当配合本公司核实您的身份的有关要求，提供包括但不限于身份信息、身份证、护照、其他有效的身份证明文件及本公司要求的其他信息或文件。\n" +
            "  7、您同意，本公司有权按照包括但不限于公安机关、检察机关、法院、海关、税务机关等司法机关、行政机关、军事机关的要求对您在禾田付的资金及账户等进行查询、冻结或扣划。\n" +
            "  四、禾田付合作商家\n" +
            "  用户都可申请成为商家用户，申请的条件为：申请用户必须拥有国家工商、税务机关等国家部门颁发的相关证照。申请时需要提交工商证照、法人手执身份证半身体照、实体店照片等相关资料。五个工作日审核完成后，后台申请同意《禾田付特约商户服务协议》，即可成为商家用户，系统将自动分配商家号与生成独一无二的商家二维码，商家就正式成为禾田付合作商家，开启所有全国通用积分共享平台与消费积分分红的服务模式。\n" +
            "  五、禾田付合伙人\n" +
            "  禾田付合伙人为本系统的最高用户级别，是为用户创业专门设立的，用于禾田付市场开发、管理之需，按所交纳的平台技术服务费不同，成为相对应的禾田付城市合伙人并享受相应的奖励政策。\n" +
            "  注：禾田付合伙人金制度由禾田付智慧商圈城市之合伙人制度另行规定。\n" +
            "  六、禾田付服务使用限制\n" +
            "  （一）您在使用本服务时应遵守中华人民共和国相关法律法规及您所属、所居住或开展经营活动或其他业务的国家或地区的法律法规，不得将本服务用于任何非法目的（包括用于禁止或限制交易物品的交易），也不得以任何非法方式使用本服务。\n" +
            "  （二）您不得利用本服务从事侵害他人合法权益之行为， 否则本公司有权拒绝提供本服务并冻结帐号，且您应承担所有相关法律责任，因此导致本公司或本公司雇员或其他方受损的，您应承担赔偿责任。\n" +
            "  上述（一）和（二）适用的情况包括但不限于：\n" +
            "  1、侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权等合法权益。\n" +
            "  2、违反依法定或约定之保密义务。\n" +
            "  3、冒用他人名义使用本服务。\n" +
            "  4、从事不法交易行为， 如洗钱、恐怖融资、贩卖枪支、毒品、禁药、盗版软件、黄色淫秽物品、其他本公司认为不得使用本服务进行交易的物品等。\n" +
            "  5、提供赌博资讯或以任何方式引诱他人参与赌博。\n" +
            "  6、非法使用他人银行账户（包括信用卡账户）或无效银行账户（包括信用卡账户）交易。\n" +
            "  7、违反《银行卡业务管理办法》使用银行卡， 或利用信用卡套取现金（以下简称套现）。\n" +
            "  8、进行与您或交易对方宣称的交易内容不符的交易，或不真实的交易。\n" +
            "  9、从事任何可能含有电脑病毒或是可能侵害本服务系统、资料之行为。\n" +
            "  10、其他本公司有正当理由认为不适当之行为。\n" +
            "  （三）您理解并同意，本公司不对因下述任一情况导致的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其他无形损失的损害赔偿（无论本公司是否已被告知该等损害赔偿的可能性）：\n" +
            "  1、本公司有权基于单方判断，包含但不限于本公司认为您已经违反本协议的明文规定及精神，对您名下的全部或部分禾田付账户暂停、中断或终止向您提供本服务或其任何部分，并移除您的资料。\n" +
            "  2、在发现异常交易或合理怀疑交易有疑义或有违反法律规定或本协议约定之时，为维护用户资金安全和合法权益，本公司有权不经通知先行暂停或终止您名下全部或部分禾田付账户的使用与分红（包括但不限于对这些账户名下的款项和在途交易采取取消交易、调账等措施）。如涉嫌犯罪，本公司有权移交公安机关处理。\n" +
            "  3、您理解并同意，存在如下情形时，本公司有权对您名下禾田付账户暂停或终止提供全部或部分禾田付服务，或对全部或部分余额进行止付，且有权限制您所使用的产品或服务的部分或全部功能，并通过邮件或站内信或者客户端通知等方式通知您，您应及时予以关注：\n" +
            "  1）根据本协议的约定；\n" +
            "  2）根据法律法规及法律文书的规定；\n" +
            "  3）根据有权机关的要求；\n" +
            "  4）您使用禾田付服务的行为涉嫌违反国家法律法规及行政规定的；\n" +
            "  5）本公司基于单方面合理判断认为该账户操作、资金进出等存在异常时；\n" +
            "  6）本公司依据自行合理判断认为可能产生风险的；\n" +
            "  7）您在参加市场活动时有批量注册禾田付账户、刷信用及其他舞弊等违反活动规则、违反诚实信用原则的；\n" +
            "  8）他人向您禾田付账户错误汇入资金等导致您可能存在不当得利的；\n" +
            "  9）您遭到他人投诉，且对方已经提供了一定证据的；\n" +
            "  10）您可能错误地将他人禾田付账户进行了实名的。\n" +
            "  如您申请恢复服务、解除上述止付或限制，您应按本公司要求如实提供相关资料及您的身份证明以及本公司要求的其他信息或文件，以便本公司进行核实，且本公司有权依照自行判断来决定是否同意您的申请。您应充分理解您的申请并不必然被允许。您拒绝如实提供相关资料及身份证明的，或未通过本公司审核的，则您确认本公司有权长期对该等账户停止提供服务且长期限制该等产品或者服务的部分或全部功能。\n" +
            "  在本公司认为该等异常已经得到合理解释或有效证据支持或未违反国家相关法律法规及部门规章的情况下，最晚将于止付款项或暂停执行指令之日起的30个日历天内解除止付或限制。但本公司有进一步理由相信该等异常仍可能对您或其他用户或本公司造成损失的情形除外，包括但不限于：\n" +
            "  1）收到针对该等异常的投诉：\n" +
            "  2）您已经实质性违反了本协议或另行签署的协议，且我们基于保护各方利益的需要必须继续止付款项或暂停执行指令：\n" +
            "  3）您虽未违反国家相关法律法规及部门规章规定，但该等使用涉及本公司限制合作的行业类目或商品，包括但不限于通过本公司的产品或服务从事类似金字塔或矩阵型的高额返利业务模式。\n" +
            "  5、在本公司合理认为有必要时，本公司无需事先通知即可终止提供本服务，并暂停、关闭或删除您名下全部或部分禾田付账户及该账户中所有相关资料及档案，并将您滞留在该账户的全部合法余额退回到您的银行账户。\n" +
            "  （四）您理解并同意，如因您进行与您宣称的交易内容不符的交易，或违反您所在平台对商品类目管理的规定，导致本公司、您所在平台或用户遭受损失的，本公司有权向您追偿并有权随时从您名下的禾田付账户扣除相应资金以弥补该等损失。且本公司有权对您名下禾田付账户暂停或终止向您提供部分或全部禾田付服务，或对您名下禾田付账户的余额的部分或全部进行止付。\n" +
            "  七、隐私权保护\n" +
            "  本公司重视对用户隐私的保护。关于您的身份资料和其他特定资料依本协议所载明的受到保护与规范。\n" +
            "  八、系统中断或故障\n" +
            "  本公司系统因下列状况无法正常运作，使您无法使用或无法正常使用各项服务时，本公司不承担损害赔偿责任，该状况包括但不限于：\n" +
            "  （一）本公司在本网站公告之系统停机维护期间。\n" +
            "  （二）电信设备出现故障不能正常进行数据传输的。\n" +
            "  （三）因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成本公司系统障碍不能正常执行业务的。\n" +
            "  （四）由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟。\n" +
            "  九、责任范围及责任限制\n" +
            "  （一）本公司仅对本协议中列明的责任承担范围负责。\n" +
            "  （二）您明确因使用本服务从事的交易所产生的任何风险应由您与交易对方承担。\n" +
            "  （三）本公司用户信息是由用户本人自行提供的，本公司无法保证该信息之准确、及时和完整，您应对您的判断承担全部责任。\n" +
            "  （四）本公司不对交易标的及本服务提供任何形式的保证，包括但不限于以下事项:\n" +
            "  1、本服务符合您的需求。\n" +
            "  2、本服务不受干扰、及时提供或免于出错。\n" +
            "  3、您使用本服务购买或取得之任何产品、服务、资讯或其他资料符合您的期望。\n" +
            "  4、您使用本服务从事的交易及时或最终完成。\n" +
            "  （五）本服务之合作单位，所提供之服务品质及内容由该合作单位自行负责。\n" +
            "  （六）您经由本服务之使用下载或取得任何资料，应由您自行考量且自负风险，因资料之下载而导致您电脑系统之任何损坏或资料流失，您应负完全责任。\n" +
            "  （七）您自本公司及本公司工作人员或经由本服务取得之建议和资讯，无论其为书面或口头形式，均不构成本公司对本服务之保证。\n" +
            "  （八）在任何情况下，本公司对于与本协议有关或由本协议引起的任何间接的、惩罚性的、特殊的、派生的损失（包括业务损失、收益损失、利润损失、商誉损失、使用数据或其他经济利益的损失），不论是如何产生的，也不论是由对本协议的违约（包括违反保证）还是由侵权造成的，均不负有任何责任，即使事先已被告知此等损失的可能性。另外即使本协议规定的排他性救济没有达到其基本目的，也应排除本公司对上述损失的责任。\n" +
            "  （九）在任何情况下，本公司对本协议所承担的违约赔偿责任总额不超过向您收取的当次服务费用总额。\n" +
            "  （十）您充分知晓并同意本公司可能同时为您及您的（交易）对手方提供本服务，您同意对本公司可能存在的该等行为予以明确豁免任何实际或潜在的利益冲突，并不得以此来主张本公司在提供本服务时存在法律上的瑕疵。\n" +
            "  （十一）除本协议另有规定或本公司另行同意外，您对本公司的委托及向本公司发出的指令均不可撤销。\n" +
            "  十、评论、意见、消息和其他内容\n" +
            "  访问者可以张贴评论、意见及其他内容，以及提出建议、主意、意见、问题或其他信息，只要内容不是非法、淫秽、威胁、诽谤、侵犯隐私、侵犯知识产权或以其他形式对第三者构成伤害或侵犯或令公众讨厌，也不包含软件病毒、政治宣传、商业招揽、连锁信、大宗邮件或任何形式的\"垃圾邮件\"。 本系统网站保留清除或编辑这些内容的权利（但非义务），但不对所张贴的内容进行经常性的审查。系统对您或任何第三方所张贴的内容不承担责任。\n" +
            "  十一、条款的修正 \n" +
            "  我们保留在任何时候对我们的系统、网站、政策和本服务条款作出更改的权利。任何更改或修改在其被公告在网站时立即生效。您对系统平台的使用应受制于在使用时公告在本网站上的服务条款。因此，我们建议您在使用网站之前阅读此条款。您在服务条款更改或修改并公告在本网站后继续使用本网站，则表明您对该更改或修改条款的接受。如果本条款中任何一条被视为废止、无效或因任何理由不可执行，不影响任何其余条款的有效性和可执行性。\n" +
            "  十二、知识产权的保护\n" +
            "  （一）本公司及关联公司所有系统及本网站上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由本公司或本公司关联公司依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。\n" +
            "  （二）非经本公司或本公司关联企业书面同意，任何人不得擅自使用、修改、反向编译、复制、公开传播、改变、散布、发行或公开发表本网站程序或内容。\n" +
            "  （三）尊重知识产权是您应尽的义务，如有违反，您应承担损害赔偿责任。\n" +
            "  十三、适用的法律和管辖权\n" +
            "  本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，没有相关法律规定的，参照通用国际商业惯例和（或）行业惯例。\n" +
            "因本协议产生之争议，均应依照中华人民共和国法律予以处理，并由被告住所地人民法院管辖。\n" +
            "河南够幸运电子商务有限公司";
}
